app/controllers/articles_controller.rb

  def create
    #render plain: params[:article].inspect
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaadsasasdass"], ["description", "sadsaasddsadassdasdasaddsa"], ["created_at", 2017-03-24 23:31:35 UTC], ["updated_at", 2017-03-24 23:31:35 UTC]]